const hsEnglishCourses = {
"林優樹の「英文法の途中式」～中学英語から高校英語へ～": {
  "第1章": {
    "第1節 文型": [
      "1-0 Lesson 0 文型とは",
      "1-1 Lesson 1 第1文型(S+V)+M",
      "1-2 Lesson 2 第2文型(S+V+C)",
      "1-3 Lesson 3 第3文型(S+V+O)",
      "1-4 Lesson 4 自動詞と他動詞(1)",
      "1-5 Lesson 5 自動詞と他動詞(2)",
      "1-6 Lesson 6 第4文型(S+V+O+O)",
      "1-7 Lesson 7 第5文型(S+V+O+C)",
      "1-8 演習問題(1)",
      "1-9 演習問題(2)",
      "1-10 演習問題(3)(4)"
    ]
  },
  "第2章": {
    "第2節 時制": [
      "2-1 Lesson 1 現在形",
      "2-2 Lesson 2 現在進行形",
      "2-3 Lesson 3 現在進行形にしない一般動詞",
      "2-4 Lesson 4 現在完了(1)",
      "2-5 Lesson 5 現在完了(2)",
      "2-6 Lesson 6 現在完了と過去形",
      "2-7 Lesson 7 過去完了",
      "2-8 Lesson 8 未来完了",
      "2-9 Lesson 9 完了進行形",
      "2-10 Lesson 10 時・条件を表す副詞節",
      "2-11 Lesson 11 副詞節と名詞節",
      "2-12 Lesson 12 未来を表す表現"
    ]
  },
  "第3章": {
    "第3節 態": [
      "3-1 Lesson 1 受動態",
      "3-2 Lesson 2 能動態から受動態へ",
      "3-3 Lesson 3 byを使わない受動態"
    ]
  },
  "第4章": {
    "第4節 助動詞": [
      "4-1 Lesson 1 基本的な助動詞(1)",
      "4-2 Lesson 2 基本的な助動詞(2)",
      "4-3 Lesson 3 基本的な助動詞(3)",
      "4-4 Lesson 4 助動詞+have+過去分詞(past participle)",
      "4-5 Lesson 5 その他の助動詞(1)",
      "4-6 Lesson 6 その他の助動詞(2)",
      "4-7 Lesson 7 その他の助動詞(3)",
      "4-8 Lesson 8 その他の助動詞(4)"
    ]
  },
  "第5章": {
    "第5節 仮定法": [
      "5-1 Lesson 0 仮定法とは(1)",
      "5-2 Lesson 0.5 仮定法とは(2)",
      "5-3 Lesson 1 仮定法のルール(1)",
      "5-4 Lesson 2 仮定法のルール(2)",
      "5-5 演習問題(1)",
      "5-6 Lesson 3 仮定法過去と仮定法過去完了の併用",
      "5-7 Lesson 4 仮定法未来",
      "5-8 演習問題(2)",
      "5-9 Lesson 5 仮定法のさまざまな表現(1)",
      "5-10 Lesson 6 仮定法のさまざまな表現(2)",
      "5-11 演習問題(3)",
      "5-12 Lesson 7 仮定法のさまざまな表現(3)",
      "5-13 Lesson 8 仮定法の倒置",
      "5-14 演習問題(4)"
    ]
  },
  "第6章": {
    "第6節 不定詞": [
      "6-1 Lesson 1 不定詞の名詞的用法(1)",
      "6-2 Lesson 2 不定詞の名詞的用法(2)",
      "6-3 Lesson 3 不定詞の形容詞的活用",
      "6-4 Lesson 4 不定詞の副詞的用法(1)",
      "6-5 Lesson 5 不定詞の副詞的用法(2)",
      "6-6 Lesson 6 不定詞の副詞的用法(3)",
      "6-7 Lesson 7 notのはtoの前",
      "6-8 Lesson 8 人の性質を表す形容詞「あいつは○○な奴だ！！」",
      "6-9 Lesson 9 完了不定詞",
      "6-10 Lesson 10 「tell+人+to V'原形」型の一般動詞",
      "6-11 Lesson 11 原形不定詞",
      "6-12 Lesson 12 不定詞を用いた表現",
      "6-13 Lesson 13 be動詞+to不定詞",
      "6-14 Lesson 14 独立不定詞"
    ]
  },
  "第7章": {
    "第7節 動名詞": [
      "7-1 Lesson 1 動名詞の基本的な使い方",
      "7-2 Lesson 2 動名詞の意味上の主語",
      "7-3 Lesson 3 動名詞の完了形",
      "7-4 Lesson 4 動名詞の否定語は動名詞の直前に置く",
      "7-5 Lesson 5 動名詞を用いた慣用表現(1)",
      "7-6 Lesson 6 動名詞を用いた慣用表現(1)のまとめ",
      "7-7 Lesson 7 動名詞を用いた慣用表現(2)",
      "7-8 Lesson 8 動名詞を用いた慣用表現(3)",
      "7-9 Lesson 9 動名詞を用いた慣用表現(2)(3)のまとめ"
    ]
  },
  "第8章": {
    "第8節 不定詞と動名詞": [
      "8-1 Lesson 1 不定詞と動名詞の基本的な違い",
      "8-2 Lesson 2 不定詞を目的語にとる一般動詞",
      "8-3 Lesson 3 動名詞を目的語にとる一般動詞",
      "8-4 Lesson 4 まとめ",
      "8-5 〈問題演習1〉",
      "8-6 Lesson 5 不定詞と動名詞の両方を目的語にとる動詞",
      "8-7 〈問題演習2〉"
    ]
  },
  "第9章": {
    "第9節 分詞": [
      "9-1 Lesson 0 現在分詞と過去分詞",
      "9-2 Lesson 1 名詞を修飾する分詞",
      "9-3 Lesson 2 SVOCのCに分詞を用いる(1)",
      "9-4 Lesson 3 SVOCのCに分詞を用いる(2)"
    ]
  },
  "第10章": {
    "第10節 分詞構文": [
      "10-1 Lesson 0 分詞構文とは",
      "10-2 Lesson 1 分詞構文の作り方(1)",
      "10-3 Lesson 2 分詞構文の作り方(2)",
      "10-4 Lesson 3 分詞構文の作り方(3)",
      "10-5 Lesson 4 分詞構文の慣用表現",
      "10-6 Lesson 5 付帯状況のwith",
      "10-7 〈問題演習1〉"
    ]
  },
  "第11章": {
    "第11節 比較①": [
      "11-1 Lesson 1 比較級と最上級",
      "11-2 〈問題演習1〉",
      "11-3 Lesson 2 as 原級 as",
      "11-4 〈問題演習2〉",
      "11-5 Lesson 3 not so[as] 原級 as...",
      "11-6 Lesson 4 倍数表現①",
      "11-7 Lesson 5 倍数表現②",
      "11-8 Lesson 6 比較級の差を強める表現①",
      "11-9 Lesson 7 比較級の差を強める表現②",
      "11-10 Lesson 8 最上級の差を強める表現"
    ]
  },
  "第12章": {
    "第12節 比較②": [
      "12-1 Lesson 9 than を使わない比較級",
      "12-2 Lesson 10 ラテン比較級",
      "12-3 Lesson 11 no more...than／no less...than①",
      "12-4 Lesson 12 no more...than／no less...than②",
      "12-5 〈問題演習3〉",
      "12-6 Lesson 13 no more than／no less than",
      "12-7 Lesson 14 as...as any～",
      "12-8 Lesson 15 the 比較級..., the 比較級…",
      "12-9 Lesson 16 know better than to V'原形"
    ]
  },
  "第13章": {
    "第13節 関係詞①": [
      "13-1 Lesson 0 それぞれの疑問詞or関係詞の特徴",
      "13-2 Lesson 1 関係詞の働き",
      "13-3 Lesson 2 関係代名詞①",
      "13-4 Lesson 3 関係代名詞②",
      "13-5 Lesson 4 関係代名詞whose",
      "13-6 Lesson 5 関係代名詞that①",
      "13-7 Lesson 5 関係代名詞that②"
    ]
  },
  "第14章": {
    "第14節 関係詞②": [
      "14-1 Lesson 1 関係副詞とは①",
      "14-2 Lesson 2 関係副詞とは②",
      "14-3 Lesson 3 関係副詞の使い分け",
      "14-4 Lesson 4 関係代名詞と関係副詞の使い分け",
      "14-5 〈問題演習1〉(1)～(4)",
      "14-6 〈問題演習1〉(5)～(7)",
      "14-7 Lesson 5 関係詞whatとhow①",
      "14-8 Lesson 6 関係詞whatとhow②",
      "14-9 Lesson 7 関係詞の非制限用法①",
      "14-10 Lesson 8 関係詞の非制限用法②",
      "14-11 Lesson 9 what を使った重要表現①",
      "14-12 Lesson 10 what を使った重要表現②",
      "14-13 Lesson 11 what を使った重要表現③",
      "14-14 Lesson 12 複合関係詞とは",
      "14-15 Lesson 13 注意すべき複合関係詞の使い方…の前に",
      "14-16 Lesson 14 注意すべき複合関係詞の使い方"
    ]
  },
  "第15章": {
    "第15節 疑問文": [
      "15-1 Lesson1 間接疑問文とは",
      "15-2 Lesson1 練習問題①",
      "15-3 Lesson1 練習問題②",
      "15-4 Lesson2 付加疑問文",
      "15-5 Lesson3 否定疑問文とは",
      "15-6 Lesson4 疑問文の慣用表現(1)",
      "15-7 Lesson4 疑問文の慣用表現(2)",
      "15-8 Lesson4 疑問文の慣用表現(3)",
      "15-9 Lesson4 疑問文の慣用表現(4)",
      "15-10 Lesson4 練習問題"
    ]
  },
  "第16章": {
    "第16節 否定": [
      "16-1 Lesson0 否定語句はどこに置くべきか",
      "16-2 Lesson1 程度の否定／頻度の否定",
      "16-3 Lesson2 数／量の否定",
      "16-4 Lesson3 部分否定と全体否定",
      "16-5 Lesson4 否定語句を用いた慣用表現①",
      "16-6 Lesson5 否定語句を用いた慣用表現②",
      "16-7 Lesson6 否定語句を用いた慣用表現③",
      "16-8 Lesson7 否定語句を用いない慣用表現①",
      "16-9 Lesson8 否定語句を用いない慣用表現②",
      "16-10 Lesson9 否定語句を用いない慣用表現③",
      "16-11 Lesson10 butを用いた表現…の前に！",
      "16-12 Lesson11 butを用いた表現①",
      "16-13 Lesson12 butを用いた表現②"
    ]
  },
  "第17章": {
    "第17節 倒置": [
      "17-1 Lesson1 倒置とは",
      "17-2 Lesson2 否定語を用いたイディオム①",
      "17-3 Lesson3 否定語を用いたイディオム②",
      "17-4 Lesson4 否定語を用いたイディオム③",
      "17-5 Lesson5 同意を表す際に用いる倒置"
    ]
  },
  "第18章": {
    "第18節 強調": [
      "18-1 Lesson0 強調とは",
      "18-2 Lesson1 一般動詞の強調",
      "18-3 Lesson2 形容詞の強調",
      "18-4 Lesson3 疑問詞の強調",
      "18-5 Lesson4 名詞の強調",
      "18-6 Lesson5 not(副詞)の強調",
      "18-7 Lesson6 強調構文①",
      "18-8 Lesson7 強調構文②"
    ]
  },
  "第19章": {
    "第19節 動詞の語法": [
      "19-1 Lesson1 間違えやすい他動詞",
      "19-1 Lesson1 演習問題",
      "19-2 Lesson2 間違えやすい自動詞",
      "19-3 Lesson3 見た目が紛らわしい動詞①【lie・lay・lie】",
      "19-4 Lesson4 見た目が紛らわしい動詞②【rise・raise・arise】",
      "19-5 Lesson5 見た目が紛らわしい動詞③【find・found】",
      "19-6 Lesson6 使い分けが紛らわしい動詞①【話す系】",
      "19-7 Lesson7 使い分けが紛らわしい動詞②【貸す・借りる系】",
      "19-8 Lesson8 使い分けが紛らわしい動詞③【合う・似合う系】",
      "19-9 Lesson9 使い分けが紛らわしい動詞④【疑う系】",
      "19-10 Lesson10 SVOOを取る動詞",
      "19-10 Lesson10 演習問題",
      "19-11 Lesson11 SVOOを取らない動詞①【explain】",
      "19-12 Lesson12 SVOOを取らない動詞②【suggest】",
      "19-13 Lesson13 SVOtoV'原形を取る動詞",
      "19-14 Lesson14 SVO from V'ingを取る動詞①",
      "19-15 Lesson15 SVO1 from O2を取る動詞②",
      "19-16 Lesson16 SVO1 of O2を取る動詞①",
      "19-17 Lesson17 SVO1 of O2を取る動詞②",
      "19-18 Lesson18 SVO1 for O2を取る動詞①",
      "19-19 Lesson19 SVO1 for O2を取る動詞②",
      "19-20 Lesson20 SVO1 into O2を取る動詞",
      "19-21 Lesson21 SVO1 with O2を取る動詞",
      "19-22 Lesson21 SVO1 as O2を取る動詞"
    ]
  },
  "第20章": {
    "第20節 名詞の語法": [
      "20-1 Lesson1 可算名詞と不可算名詞",
      "20-2 Lesson2 My family is ・are",
      "20-3 Lesson3 常に複数扱いする名詞(集合名詞)",
      "20-4 Lesson4 常に不可算名詞として扱う(集合名詞)",
      "20-5 Lesson5 不可算名詞の数え方",
      "20-6 Lesson6 常に複数形のsをつけて用いる名詞・a pair of",
      "20-7 Lesson7 相互複数",
      "20-8 Lesson8 of +抽象名詞＝形容詞",
      "20-9 Lesson9 with+抽象名詞＝副詞",
      "20-10 Lesson10 「客」を表す名詞",
      "20-11 Lesson11 「お金」に関する名詞①",
      "20-12 Lesson12 「お金」に関する名詞②"
    ]
  },
  "第21章": {
    "第21節 代名詞の語法": [
      "21-1 Lesson1 oneとit",
      "21-2 Lesson2 thatとthose",
      "21-3 Lesson3 区別すべき代名詞(母数が2つ・2人の場合)",
      "21-4 Lesson4 区別すべき代名詞(母数が3つ・3人以上の場合)",
      "21-5 Lesson5 不定代名詞",
      "21-6 Lesson6 代名詞の慣用表現",
      "21-7 Lesson7 所有代名詞",
      "21-8 Lesson8 再帰代名詞"
    ]
  }
}
}
