const hsEnglishCourses = {
"林優樹の「英文法の途中式」～中学英語から高校英語へ～": {
  "第1章": {
    "第1節 文型": [
      "1-0 Lesson 0 文型とは",
      "1-1 Lesson 1 第1文型(S+V)+M",
      "1-2 Lesson 2 第2文型(S+V+C)",
      "1-3 Lesson 3 第3文型(S+V+O)",
      "1-4 Lesson 4 自動詞と他動詞(1)",
      "1-5 Lesson 5 自動詞と他動詞(2)",
      "1-6 Lesson 6 第4文型(S+V+O+O)",
      "1-7 Lesson 7 第5文型(S+V+O+C)",
      "1-8 演習問題(1)",
      "1-9 演習問題(2)",
      "1-10 演習問題(3)(4)"
    ]
  },
  "第2章": {
    "第2節 時制": [
      "2-1 Lesson 1 現在形",
      "2-2 Lesson 2 現在進行形",
      "2-3 Lesson 3 現在進行形にしない一般動詞",
      "2-4 Lesson 4 現在完了(1)",
      "2-5 Lesson 5 現在完了(2)",
      "2-6 Lesson 6 現在完了と過去形",
      "2-7 Lesson 7 過去完了",
      "2-8 Lesson 8 未来完了",
      "2-9 Lesson 9 完了進行形",
      "2-10 Lesson 10 時・条件を表す副詞節",
      "2-11 Lesson 11 副詞節と名詞節",
      "2-12 Lesson 12 未来を表す表現"
    ]
  },
  "第3章": {
    "第3節 態": [
      "3-1 Lesson 1 受動態",
      "3-2 Lesson 2 能動態から受動態へ",
      "3-3 Lesson 3 byを使わない受動態"
    ]
  },
  "第4章": {
    "第4節 助動詞": [
      "4-1 Lesson 1 基本的な助動詞(1)",
      "4-2 Lesson 2 基本的な助動詞(2)",
      "4-3 Lesson 3 基本的な助動詞(3)",
      "4-4 Lesson 4 助動詞+have+過去分詞(past participle)",
      "4-5 Lesson 5 その他の助動詞(1)",
      "4-6 Lesson 6 その他の助動詞(2)",
      "4-7 Lesson 7 その他の助動詞(3)",
      "4-8 Lesson 8 その他の助動詞(4)"
    ]
  },
  "第5章": {
    "第5節 仮定法": [
      "5-1 Lesson 0 仮定法とは(1)",
      "5-2 Lesson 0.5 仮定法とは(2)",
      "5-3 Lesson 1 仮定法のルール(1)",
      "5-4 Lesson 2 仮定法のルール(2)",
      "5-5 演習問題(1)",
      "5-6 Lesson 3 仮定法過去と仮定法過去完了の併用",
      "5-7 Lesson 4 仮定法未来",
      "5-8 演習問題(2)",
      "5-9 Lesson 5 仮定法のさまざまな表現(1)",
      "5-10 Lesson 6 仮定法のさまざまな表現(2)",
      "5-11 演習問題(3)",
      "5-12 Lesson 7 仮定法のさまざまな表現(3)",
      "5-13 Lesson 8 仮定法の倒置",
      "5-14 演習問題(4)"
    ]
  },
  "第6章": {
    "第6節 不定詞": [
      "6-1 Lesson 1 不定詞の名詞的用法(1)",
      "6-2 Lesson 2 不定詞の名詞的用法(2)",
      "6-3 Lesson 3 不定詞の形容詞的活用",
      "6-4 Lesson 4 不定詞の副詞的用法(1)",
      "6-5 Lesson 5 不定詞の副詞的用法(2)",
      "6-6 Lesson 6 不定詞の副詞的用法(3)",
      "6-7 Lesson 7 notのはtoの前",
      "6-8 Lesson 8 人の性質を表す形容詞「あいつは○○な奴だ！！」",
      "6-9 Lesson 9 完了不定詞",
      "6-10 Lesson 10 「tell+人+to V'原形」型の一般動詞",
      "6-11 Lesson 11 原形不定詞",
      "6-12 Lesson 12 不定詞を用いた表現",
      "6-13 Lesson 13 be動詞+to不定詞",
      "6-14 Lesson 14 独立不定詞"
    ]
  },
  "第7章": {
    "第7節 動名詞": [
      "7-1 Lesson 1 動名詞の基本的な使い方",
      "7-2 Lesson 2 動名詞の意味上の主語",
      "7-3 Lesson 3 動名詞の完了形",
      "7-4 Lesson 4 動名詞の否定語は動名詞の直前に置く",
      "7-5 Lesson 5 動名詞を用いた慣用表現(1)",
      "7-6 Lesson 6 動名詞を用いた慣用表現(1)のまとめ",
      "7-7 Lesson 7 動名詞を用いた慣用表現(2)",
      "7-8 Lesson 8 動名詞を用いた慣用表現(3)",
      "7-9 Lesson 9 動名詞を用いた慣用表現(2)(3)のまとめ"
    ]
  },
  "第8章": {
    "第8節 不定詞と動名詞": [
      "8-1 Lesson 1 不定詞と動名詞の基本的な違い",
      "8-2 Lesson 2 不定詞を目的語にとる一般動詞",
      "8-3 Lesson 3 動名詞を目的語にとる一般動詞",
      "8-4 Lesson 4 まとめ",
      "8-5 〈問題演習1〉",
      "8-6 Lesson 5 不定詞と動名詞の両方を目的語にとる動詞",
      "8-7 〈問題演習2〉"
    ]
  },
  "第9章": {
    "第9節 分詞": [
      "9-1 Lesson 0 現在分詞と過去分詞",
      "9-2 Lesson 1 名詞を修飾する分詞",
      "9-3 Lesson 2 SVOCのCに分詞を用いる(1)",
      "9-4 Lesson 3 SVOCのCに分詞を用いる(2)"
    ]
  },
  "第10章": {
    "第10節 分詞構文": [
      "10-1 Lesson 0 分詞構文とは",
      "10-2 Lesson 1 分詞構文の作り方(1)",
      "10-3 Lesson 2 分詞構文の作り方(2)",
      "10-4 Lesson 3 分詞構文の作り方(3)",
      "10-5 Lesson 4 分詞構文の慣用表現",
      "10-6 Lesson 5 付帯状況のwith",
      "10-7 〈問題演習1〉"
    ]
  },
  "第11章": {
    "第11節 比較①": [
      "11-1 Lesson 1 比較級と最上級",
      "11-2 〈問題演習1〉",
      "11-3 Lesson 2 as 原級 as",
      "11-4 〈問題演習2〉",
      "11-5 Lesson 3 not so[as] 原級 as...",
      "11-6 Lesson 4 倍数表現①",
      "11-7 Lesson 5 倍数表現②",
      "11-8 Lesson 6 比較級の差を強める表現①",
      "11-9 Lesson 7 比較級の差を強める表現②",
      "11-10 Lesson 8 最上級の差を強める表現"
    ]
  },
  "第12章": {
    "第12節 比較②": [
      "12-1 Lesson 9 than を使わない比較級",
      "12-2 Lesson 10 ラテン比較級",
      "12-3 Lesson 11 no more...than／no less...than①",
      "12-4 Lesson 12 no more...than／no less...than②",
      "12-5 〈問題演習3〉",
      "12-6 Lesson 13 no more than／no less than",
      "12-7 Lesson 14 as...as any～",
      "12-8 Lesson 15 the 比較級..., the 比較級…",
      "12-9 Lesson 16 know better than to V'原形"
    ]
  },
  "第13章": {
    "第13節 関係詞①": [
      "13-1 Lesson 0 それぞれの疑問詞or関係詞の特徴",
      "13-2 Lesson 1 関係詞の働き",
      "13-3 Lesson 2 関係代名詞①",
      "13-4 Lesson 3 関係代名詞②",
      "13-5 Lesson 4 関係代名詞whose",
      "13-6 Lesson 5 関係代名詞that①",
      "13-7 Lesson 5 関係代名詞that②"
    ]
  },
  "第14章": {
    "第14節 関係詞②": [
      "14-1 Lesson 1 関係副詞とは①",
      "14-2 Lesson 2 関係副詞とは②",
      "14-3 Lesson 3 関係副詞の使い分け",
      "14-4 Lesson 4 関係代名詞と関係副詞の使い分け",
      "14-5 〈問題演習1〉(1)～(4)",
      "14-6 〈問題演習1〉(5)～(7)",
      "14-7 Lesson 5 関係詞whatとhow①",
      "14-8 Lesson 6 関係詞whatとhow②",
      "14-9 Lesson 7 関係詞の非制限用法①",
      "14-10 Lesson 8 関係詞の非制限用法②",
      "14-11 Lesson 9 what を使った重要表現①",
      "14-12 Lesson 10 what を使った重要表現②",
      "14-13 Lesson 11 what を使った重要表現③",
      "14-14 Lesson 12 複合関係詞とは",
      "14-15 Lesson 13 注意すべき複合関係詞の使い方…の前に",
      "14-16 Lesson 14 注意すべき複合関係詞の使い方"
    ]
  },
  "第15章": {
    "第15節 疑問文": [
      "15-1 Lesson1 間接疑問文とは",
      "15-2 Lesson1 練習問題①",
      "15-3 Lesson1 練習問題②",
      "15-4 Lesson2 付加疑問文",
      "15-5 Lesson3 否定疑問文とは",
      "15-6 Lesson4 疑問文の慣用表現(1)",
      "15-7 Lesson4 疑問文の慣用表現(2)",
      "15-8 Lesson4 疑問文の慣用表現(3)",
      "15-9 Lesson4 疑問文の慣用表現(4)",
      "15-10 Lesson4 練習問題"
    ]
  },
  "第16章": {
    "第16節 否定": [
      "16-1 Lesson0 否定語句はどこに置くべきか",
      "16-2 Lesson1 程度の否定／頻度の否定",
      "16-3 Lesson2 数／量の否定",
      "16-4 Lesson3 部分否定と全体否定",
      "16-5 Lesson4 否定語句を用いた慣用表現①",
      "16-6 Lesson5 否定語句を用いた慣用表現②",
      "16-7 Lesson6 否定語句を用いた慣用表現③",
      "16-8 Lesson7 否定語句を用いない慣用表現①",
      "16-9 Lesson8 否定語句を用いない慣用表現②",
      "16-10 Lesson9 否定語句を用いない慣用表現③",
      "16-11 Lesson10 butを用いた表現…の前に！",
      "16-12 Lesson11 butを用いた表現①",
      "16-13 Lesson12 butを用いた表現②"
    ]
  },
  "第17章": {
    "第17節 倒置": [
      "17-1 Lesson1 倒置とは",
      "17-2 Lesson2 否定語を用いたイディオム①",
      "17-3 Lesson3 否定語を用いたイディオム②",
      "17-4 Lesson4 否定語を用いたイディオム③",
      "17-5 Lesson5 同意を表す際に用いる倒置"
    ]
  },
  "第18章": {
    "第18節 強調": [
      "18-1 Lesson0 強調とは",
      "18-2 Lesson1 一般動詞の強調",
      "18-3 Lesson2 形容詞の強調",
      "18-4 Lesson3 疑問詞の強調",
      "18-5 Lesson4 名詞の強調",
      "18-6 Lesson5 not(副詞)の強調",
      "18-7 Lesson6 強調構文①",
      "18-8 Lesson7 強調構文②"
    ]
  },
  "第19章": {
    "第19節 動詞の語法": [
      "19-1 Lesson1 間違えやすい他動詞",
      "19-1 Lesson1 演習問題",
      "19-2 Lesson2 間違えやすい自動詞",
      "19-3 Lesson3 見た目が紛らわしい動詞①【lie・lay・lie】",
      "19-4 Lesson4 見た目が紛らわしい動詞②【rise・raise・arise】",
      "19-5 Lesson5 見た目が紛らわしい動詞③【find・found】",
      "19-6 Lesson6 使い分けが紛らわしい動詞①【話す系】",
      "19-7 Lesson7 使い分けが紛らわしい動詞②【貸す・借りる系】",
      "19-8 Lesson8 使い分けが紛らわしい動詞③【合う・似合う系】",
      "19-9 Lesson9 使い分けが紛らわしい動詞④【疑う系】",
      "19-10 Lesson10 SVOOを取る動詞",
      "19-10 Lesson10 演習問題",
      "19-11 Lesson11 SVOOを取らない動詞①【explain】",
      "19-12 Lesson12 SVOOを取らない動詞②【suggest】",
      "19-13 Lesson13 SVOtoV'原形を取る動詞",
      "19-14 Lesson14 SVO from V'ingを取る動詞①",
      "19-15 Lesson15 SVO1 from O2を取る動詞②",
      "19-16 Lesson16 SVO1 of O2を取る動詞①",
      "19-17 Lesson17 SVO1 of O2を取る動詞②",
      "19-18 Lesson18 SVO1 for O2を取る動詞①",
      "19-19 Lesson19 SVO1 for O2を取る動詞②",
      "19-20 Lesson20 SVO1 into O2を取る動詞",
      "19-21 Lesson21 SVO1 with O2を取る動詞",
      "19-22 Lesson21 SVO1 as O2を取る動詞"
    ]
  },
  "第20章": {
    "第20節 名詞の語法": [
      "20-1 Lesson1 可算名詞と不可算名詞",
      "20-2 Lesson2 My family is ・are",
      "20-3 Lesson3 常に複数扱いする名詞(集合名詞)",
      "20-4 Lesson4 常に不可算名詞として扱う(集合名詞)",
      "20-5 Lesson5 不可算名詞の数え方",
      "20-6 Lesson6 常に複数形のsをつけて用いる名詞・a pair of",
      "20-7 Lesson7 相互複数",
      "20-8 Lesson8 of +抽象名詞＝形容詞",
      "20-9 Lesson9 with+抽象名詞＝副詞",
      "20-10 Lesson10 「客」を表す名詞",
      "20-11 Lesson11 「お金」に関する名詞①",
      "20-12 Lesson12 「お金」に関する名詞②"
    ]
  },
  "第21章": {
    "第21節 代名詞の語法": [
      "21-1 Lesson1 oneとit",
      "21-2 Lesson2 thatとthose",
      "21-3 Lesson3 区別すべき代名詞(母数が2つ・2人の場合)",
      "21-4 Lesson4 区別すべき代名詞(母数が3つ・3人以上の場合)",
      "21-5 Lesson5 不定代名詞",
      "21-6 Lesson6 代名詞の慣用表現",
      "21-7 Lesson7 所有代名詞",
      "21-8 Lesson8 再帰代名詞"
    ]
  }
}

"成り立ち理解！PART1 必須イディオム&英文法": {
  "LESSON1": {
    "必須イディオム": [
      "take care 関連の表現について",
      "first関連のイディオム(1)",
      "first関連のイディオム(2)",
      "コラム① after を用いたイディオム表現"
    ],
    "動詞の語法①": [
      "自動詞と他動詞について(1)",
      "自動詞と他動詞について(2)",
      "自動詞と他動詞について(3)",
      "自動詞と他動詞についての注意点",
      "lie と lay について",
      "４つの「言う(speak, talk, say, tell)」(1)",
      "４つの「言う(speak, talk, say, tell)」(2)",
      "「人」を目的語に取れない伝達動詞",
      "suggest の語法",
      "help の頻出語法"
    ]
  },
  "LESSON2": {
    "必須イディオム": [
      "account について",
      "コラム② 「動詞+up with A」型のイディオム(1)",
      "コラム② 「動詞+up with A」型のイディオム(2)"
    ],
    "時制": [
      "現在時制と現在進行形について(1)",
      "現在時制と現在進行形について(2)",
      "動作動詞と状態動詞について(1)",
      "動作動詞と状態動詞について(2)",
      "動作動詞と状態動詞について(3)",
      "過去進行形と未来進行形について",
      "時・条件を表す副詞節中の動詞の時制について(1)",
      "時条件を表す副詞節中の動詞の時制について(2)",
      "現在完了の基本(1)",
      "現在完了の基本(2)",
      "現在完了の基本(3)",
      "現在完了の基本(4)",
      "現在完了と共に用いることができない語句",
      "過去完了の基本(1)",
      "過去完了の基本(2)",
      "過去完了の基本(3)",
      "未来完了の基本",
      "父が死んで3年になります型の書き換え",
      "問２＆時に関する重要構文(1)",
      "時に関する重要構文(2)"
    ]
  },
  "LESSON3": {
    "必須イディオム": [
      "部分否定について",
      "コラム③ be tired of と be tired from"
    ],
    "助動詞・態": [
      "各助動詞の意味・用法について(1)",
      "各助動詞の意味・用法について(2)",
      "各助動詞の意味・用法について(3)",
      "各助動詞の意味・用法について(4)",
      "助動詞+have+p.p.～について",
      "間違えやすい used to 関連の表現",
      "not の位置に注意すべき助動詞",
      "be known の後にくる前置詞について",
      "by 以外の前置詞を用いる「be動詞+過去分詞」の表現(1)",
      "by 以外の前置詞を用いる「be動詞+過去分詞」の表現(2)",
      "群動詞の受動態について(1)",
      "群動詞の受動態について(2)"
    ]
  },
  "LESSON4": {
    "必須イディオム": [
      "chance について",
      "poor について",
      "コラム④ 「be動詞+感情動詞の過去分詞の後に続く前置詞」(1)",
      "コラム④ 「be動詞+感情動詞の過去分詞の後に続く前置詞」(2)"
    ],
    "仮定法": [
      "現在の仮定の公式",
      "過去の仮定の公式",
      "（不確実な）未来の仮定の公式",
      "速解のための公式の整理(1)",
      "速解のための公式の整理(2)",
      "仮定法における if の省略",
      "but for A, without A",
      "I wish+仮定法",
      "It is time S+V(過去形)～",
      "as if[though]+仮定法",
      "【補完講義】その他の仮定法を用いた慣用表現",
      "【補完講義】if節のない仮定法(1)",
      "【補完講義】if節のない仮定法(2)",
      "【補完講義】if節のない仮定法(3)",
      "【補完講義】if節のない仮定法(4)",
      "【補完講義】if節のない仮定法(5)",
      "【補完講義】if節のない仮定法(6)"
    ]
  },
  "LESSON5": {
    "必須イディオム": [
      "look を用いたイディオム(1)",
      "look を用いたイディオム(2)",
      "コラム⑤ make the most of と make the best of"
    ],
    "動名詞": [
      "動名詞とは。その基本について",
      "動名詞だけを目的語に取る他動詞(1)",
      "動名詞だけを目的語に取る他動詞(2)",
      "動名詞だけを目的語に取る他動詞(3)",
      "他動詞の目的語と動名詞(4)",
      "動名詞の意味上の主語(1)",
      "動名詞の意味上の主語(2)",
      "to ～ing の慣用表現",
      "完了動名詞について",
      "動名詞を用いた慣用表現(1)",
      "動名詞を用いた慣用表現(2)",
      "動名詞を用いた慣用表現(3)"
    ]
  },
  "LESSON6": {
    "必須イディオム": [
      "stand について",
      "lie と lay, rise と raise(1)",
      "lie と lay, rise と raise(2)",
      "lie と lay, rise と raise(3)",
      "lie と lay, rise と raise(4)",
      "lie と lay, rise と raise(5)",
      "lie と lay, rise と raise(6)",
      "refer について(1)",
      "refer について(2)",
      "コラム⑥ crush と clash と crash その覚え方"
    ],
    "不定詞": [
      "不定詞の基本(1)",
      "不定詞の基本(2)",
      "不定詞の基本(3)",
      "不定詞の基本(4)",
      "不定詞の基本(5)",
      "問１＆原形不定詞(1)",
      "原形不定詞(2)",
      "S V O to do[原形]～のベスト15",
      "S V O do[原形]～のオンリー５",
      "tough構文について(1)",
      "tough構文について(2)",
      "too～to…構文について",
      "(形・副)+enough to do[原形]～",
      "不定詞の意味上の主語(1)",
      "不定詞の意味上の主語(2)",
      "It is of A(人) to do[原形]～",
      "完了不定詞について",
      "不定詞のポイントのまとめ",
      "【補完講義】不定詞のみを目的語に取る他動詞(1)",
      "【補完講義】不定詞のみを目的語に取る他動詞(2)",
      "【補完講義】独立不定詞(1)",
      "【補完講義】独立不定詞(2)"
    ]
  },
  "LESSON7": {
    "必須イディオム": [
      "yield to A と give in to A の意味の理屈",
      "intention について",
      "set について(1)",
      "set について(2)",
      "コラム⑦ be true to A と be true of A の覚え方"
    ],
    "分詞": [
      "分詞の基本(1)",
      "分詞の基本(2)",
      "分詞の基本(3)",
      "分詞の基本(4)",
      "使役動詞(have と get)のまとめと演習(1)",
      "使役動詞(have と get)のまとめと演習(2)",
      "分詞構文の基本",
      "分詞構文の注意すべきポイント(1)",
      "分詞構文の注意すべきポイント(2)",
      "その他の分詞構文の注意すべきポイント(1)",
      "その他の分詞構文の注意すべきポイント(2)",
      "その他の分詞構文の注意すべきポイント(3)",
      "間違えやすい分詞構文(1)",
      "間違えやすい分詞構文(2)",
      "with O C 構文について",
      "分詞のまとめ",
      "【補完講義】感情・被害を表す動詞の分詞形について(1)",
      "【補完講義】感情・被害を表す動詞の分詞形について(2)",
      "【補完講義】感情・被害を表す動詞の分詞形について(3)",
      "【補完講義】慣用的な分詞構文(1)",
      "【補完講義】慣用的な分詞構文(2)",
      "【補完講義】分詞構文の訳し方(1)",
      "【補完講義】分詞構文の訳し方(2)"
    ]
  },
  "LESSON8": {
    "必須イディオム": [
      "語源 cline について",
      "コラム⑧ industrial と industrious の覚え方"
    ],
    "関係詞①": [
      "関係詞の基本",
      "文法問題における関係代名詞の格の決め方(1)",
      "文法問題における関係代名詞の格の決め方(2)",
      "文法問題における関係代名詞の格の決め方(3)",
      "文法問題における関係代名詞の格の決め方(4)",
      "関係詞関連問題用の速解ルールのまとめ(1)",
      "関係詞関連問題用の速解ルールのまとめ(2)",
      "関係詞関連問題用の速解ルールのまとめ(3)",
      "「前置詞+whome[which]」について",
      "「非制限[継続]用法」について(1)",
      "「非制限[継続]用法」について(2)",
      "「非制限[継続]用法」について(3)",
      "「不定代名詞+of+目的格[whom・which]」について",
      "[補完講義] what について",
      "[補完講義] that について(1)",
      "[補完講義] that について(2)",
      "[補完講義] that について(3)",
      "[補完講義] 関係副詞について(1)",
      "[補完講義] 関係副詞について(2)",
      "[補完講義] 関係副詞について(3)",
      "[補完講義] 関係副詞について(4)"
    ]
  },
  "LESSON9": {
    "必須イディオム": [
      "follow について(1)",
      "follow について(2)",
      "support について",
      "コラム⑨ abundant と abandon",
      "コラム⑨ rust と lust"
    ],
    "関係詞②": [
      "what を用いた慣用表現",
      "「what[which]+名詞」について(1)",
      "「what[which]+名詞」について(2)",
      "複合関係詞(関係詞+ever)節のまとめ",
      "関係副詞+ever の補足",
      "whoever と whomever の見きわめ法",
      "whatever と whichever の見きわめ法",
      "【補完講義】解釈における注意点",
      "【補完講義】文[節]頭の who[what・which]+ever節の見きわめ法"
    ]
  },
  "LESSON10": {
    "必須イディオム": [
      "語源 pend について",
      "attract について",
      "equal について",
      "コラム⑩ ２つの「疑う」。doubt と suspect"
    ],
    "接続詞": [
      "接続詞に関わる問題についての基本的アプローチ",
      "接続詞基本チェック(1)",
      "接続詞基本チェック(2)",
      "接続詞基本チェック(3)",
      "接続詞基本チェック(4)",
      "接続詞基本チェック(5)",
      "接続詞基本チェック(6)",
      "接続詞基本チェック(7)",
      "接続詞基本チェック(8)",
      "接続詞基本チェック(9)",
      "接続詞基本チェック(10)",
      "接続詞基本チェック(11)",
      "接続詞基本チェック(12)",
      "so～that S+V… such～that S+V… について(1)",
      "so～that S+V… such～that S+V… について(2)",
      "that について(1)",
      "that について(2)"
    ]
  },
  "LESSON11": {
    "必須イディオム": [
      "語源 re (1)",
      "語源 re (2)",
      "prove について",
      "wear について(1)",
      "wear について(2)",
      "advantage について",
      "いろいろな「似ている」(1)",
      "いろいろな「似ている」(2)",
      "order について",
      "put on とwear について",
      "コラム⑪ differ[be different] の後に続く前置詞について"
    ],
    "比較": [
      "「原級比較の否定」と「劣等比較」について",
      "倍数表現について",
      "最上級の代用表現について",
      "比較級を強調する副詞(1)",
      "比較級を強調する副詞(2)",
      "比較級に the がつく４パターン(1)",
      "比較級に the がつく４パターン(2)",
      "比較級に the がつく４パターン(3)",
      "比較級に the がつく４パターン(4)",
      "比較級に the がつく４パターン(5)",
      "比較級に the がつく４パターン(6)",
      "「よりも」の意味で to を用いる比較表現",
      "reason について",
      "【補完講義】原級比較を用いた慣用表現(1)",
      "【補完講義】原級比較を用いた慣用表現(2)",
      "【補完講義】比較級を用いた慣用表現",
      "【補完講義】最上級で大切なこと＆最上級を用いた慣用表現(1)",
      "【補完講義】最上級で大切なこと＆最上級を用いた慣用表現(2)",
      "【補完講義】最上級で大切なこと＆最上級を用いた慣用表現(3)",
      "【補完講義】クジラ構文(1)",
      "【補完講義】クジラ構文(2)",
      "【補完講義】クジラ構文(3)",
      "【補完講義】クジラ構文(4)",
      "【補完講義】クジラ構文(5)",
      "【補完講義】クジラ構文(6)",
      "【補完講義】クジラ構文(7)",
      "【補完講義】クジラ構文(8)",
      "【補完講義】クジラ構文(9)",
      "【補完講義】クジラ構文(10)",
      "【補完講義】必ず「more+原級」にする表現",
      "【補完講義】比較の対象同士は、基本的に同じ種類でなくてはならない"
    ]
  },
  "LESSON12": {
    "必須イディオム": [
      "appoint について",
      "gradually について",
      "コラム⑫"
    ],
    "動詞の語法②": [
      "cause について",
      "「～になる」と「～するようになる」",
      "一般動詞の do の意外な語法について",
      "name について",
      "「借りる」と「貸す」のいろいろ",
      "「合う」のいろいろ",
      "「書く」と「描く」",
      "draw について",
      "meet について",
      "lower について",
      "pay について",
      "crime について",
      "blame について",
      "語源 press"
    ]
  },
  "LESSON13": {
    "必須イディオム": [
      "figure について(1)",
      "figure について(2)",
      "figure について(3)",
      "figure について(4)",
      "amuse と cheat について",
      "「～に関して」のいろいろ",
      "コラム⑬"
    ],
    "名詞・冠詞": [
      "「可算名詞」と「不可算名詞」(1)",
      "「可算名詞」と「不可算名詞」(2)",
      "「可算名詞」と「不可算名詞」(3)",
      "「可算名詞」と「不可算名詞」(4)",
      "「可算名詞」と「不可算名詞」(5)",
      "「可算名詞」と「不可算名詞」(6)",
      "「可算名詞」と「不可算名詞」(7)",
      "「可算名詞」と「不可算名詞」(8)",
      "「可算名詞」と「不可算名詞」(9)",
      "「可算名詞」と「不可算名詞」(10)",
      "数量形容詞について(1)",
      "数量形容詞について(2)",
      "「不可算名詞」の数え方(1)",
      "「不可算名詞」の数え方(2)",
      "「不可算名詞」の数え方(3)",
      "必ず複数形を用いる慣用表現(1)",
      "必ず複数形を用いる慣用表現(2)",
      "必ず複数形を用いる慣用表現(3)",
      "必ず複数形を用いる慣用表現(4)",
      "紛らわしい名詞(1) いろいろな「客」",
      "紛らわしい名詞(2) いろいろな「お金」",
      "紛らわしい名詞(3) いろいろな「習慣」",
      "紛らわしい名詞(4) ２つの「移民」",
      "紛らわしい名詞(5) いろいろな「約束」",
      "定冠詞の the の基本と特殊用法(1)",
      "定冠詞の the の基本と特殊用法(2)",
      "定冠詞の the の基本と特殊用法(3)",
      "定冠詞の the の基本と特殊用法(4)",
      "冠詞の a の基本と特殊用法(1)",
      "冠詞の a の基本と特殊用法(2)",
      "冠詞の a の基本と特殊用法(3)",
      "preserve について",
      "副詞の so, as, how, too の後の語順変化のルール",
      "command について",
      "【補完講義】交通[通信]手段を表す by と冠詞について"
    ]
  },
  "LESSON14": {
    "必須イディオム": [
      "apply について",
      "remember と remind について(1)",
      "remember と remind について(2)",
      "コラム⑭"
    ],
    "代名詞": [
      "it, one, that の使い分け(1)",
      "it, one, that の使い分け(2)",
      "it, one, that の使い分け(3)",
      "it, one, that の使い分け(4)",
      "it, one, that の使い分け(5)",
      "consider関連、respect関連の類義語の語源を用いた覚え方",
      "「ほとんどのＡ、Ａのほとんど」(1)",
      "「ほとんどのＡ、Ａのほとんど」(2)",
      "「ほとんどのＡ、Ａのほとんど」(3)",
      "one と the other(s), another などについて(1)",
      "one と the other(s), another などについて(2)",
      "one と the other(s), another などについて(3)",
      "another の頻出用法(1)",
      "another の頻出用法(2)",
      "another の頻出用法(3)",
      "「前置詞+oneself」の慣用表現(1)",
      "「前置詞+oneself」の慣用表現(2)",
      "odd について(1)",
      "odd について(2)",
      "指示代名詞や冠詞などを所有格と並べて置くことはできない",
      "【補完講義】all(1)",
      "【補完講義】all(2)",
      "【補完講義】none(1)",
      "【補完講義】none(2)",
      "【補完講義】each",
      "【補完講義】both",
      "【補完講義】either(1)",
      "【補完講義】either(2)",
      "【補完講義】neither",
      "【補完講義】every(1)",
      "【補完講義】every(2)",
      "【補完講義】不定代名詞と数（単数・複数）",
      "【補完講義】再帰代名詞(oneself)について(1)",
      "【補完講義】再帰代名詞(oneself)について(2)",
      "【補完講義】再帰代名詞(oneself)について(3)",
      "【補完講義】再帰代名詞(oneself)について(4)",
      "【補完講義】再帰代名詞(oneself)について(5)",
      "【補完講義】再帰代名詞(oneself)について(6)",
      "【補完講義】再帰代名詞(oneself)について(7)",
      "【補完講義】疑問代名詞と疑問副詞の違い(1)",
      "【補完講義】疑問代名詞と疑問副詞の違い(2)",
      "【補完講義】what と how の使い分け(1)",
      "【補完講義】what と how の使い分け(2)",
      "【補完講義】what と how の使い分け(3)",
      "【補完講義】what と how の使い分け(4)",
      "【補完講義】疑問代名詞の what を用いた慣用表現(1)",
      "【補完講義】疑問代名詞の what を用いた慣用表現(2)",
      "【補完講義】疑問代名詞の what を用いた慣用表現(3)",
      "【補完講義】疑問代名詞の what を用いた慣用表現(4)",
      "【補完講義】代名詞を用いた慣用表現(1)",
      "【補完講義】代名詞を用いた慣用表現(2)",
      "【補完講義】代名詞を用いた慣用表現(3)",
      "【補完講義】代名詞を用いた慣用表現(4)",
      "【補完講義】代名詞を用いた慣用表現(5)"
    ]
  },
  "LESSON15": {
    "必須イディオム": [
      "「～するとすぐに…した」を表す慣用表現",
      "コラム⑮"
    ],
    "形容詞・副詞": [
      "形容詞の基本",
      "副詞の基本",
      "「形容詞・副詞」がテーマでよくあるタイプの問題(1)",
      "「形容詞・副詞」がテーマでよくあるタイプの問題(2)",
      "living,alive,live の使い分け(1)",
      "living,alive,live の使い分け(2)",
      "「多い・少ない」「大きい・小さい」を表す形容詞や副詞",
      "how soon について",
      "otherwise について(1)",
      "otherwise について(2)",
      "present について(1)",
      "present について(2)",
      "present について(3)",
      "【補完講義】形容詞の限定用法と叙述用法(1)",
      "【補完講義】形容詞の限定用法と叙述用法(2)",
      "【補完講義】形容詞の限定用法と叙述用法(3)",
      "【補完講義】形容詞の限定用法と叙述用法(4)",
      "【補完講義】形容詞の限定用法と叙述用法(5)",
      "【補完講義】形容詞の限定用法と叙述用法(6)",
      "【補完講義】形容詞の限定用法と叙述用法(7)",
      "【補完講義】もう一歩深く",
      "【補完講義】respect の派生語",
      "【補完講義】imagine, compare, depend の派生語",
      "【補完講義】sense, value の派生語",
      "【補完講義】narrow, small, art の派生語",
      "【補完講義】empty, vacant, consider の派生語",
      "【補完講義】wise, clever, expensive, high",
      "【補完講義】economic, economical",
      "【補完講義】「早い」と「速い」",
      "【補完講義】「高い」と「安い[低い]」",
      "【補完講義】「多い」と「少ない」、「大きい」と「小さい」",
      "【補完講義】「広い」と「狭い」",
      "【補完講義】「濃い」と「薄い」",
      "【補完講義】ago と before",
      "【補完講義】「まだ」という意味の still と yet",
      "【補完講義】「最近」を表す nowadays, these days, lately, recently",
      "【補完講義】-ly が付く形とそうでない形で意味が異なる副詞",
      "【補完講義】名詞と間違えやすい副詞",
      "【補完講義】how soon について",
      "【補完講義】「人」を主語にできない形容詞(1)",
      "【補完講義】「人」を主語にできない形容詞(2)"
    ]
  },
  "LESSON16": {
    "必須イディオム": [
      "content について",
      "deal について",
      "コラム⑯"
    ],
    "否定・倒置・語順・強調": [
      "「ほとんど～ない」と「滅多に～ない」(1)",
      "「ほとんど～ない」と「滅多に～ない」(2)",
      "「まったく[少しも]～ない」のいろいろな表現",
      "間接疑問文における疑問詞節内の語順について(1)",
      "間接疑問文における疑問詞節内の語順について(2)",
      "部分否定について",
      "(準)否定の副詞の倒置について(1)",
      "(準)否定の副詞の倒置について(2)",
      "So V S. Nor[Neither] V S. について",
      "肯定文の後で「Nor+疑問文の語順」がありうる",
      "引っかけ問題",
      "二重否定について",
      "否定語を含まない否定表現(1)",
      "否定語を含まない否定表現(2)",
      "否定語を含まない否定表現(3)",
      "【補完講義】強調構文について(1)",
      "【補完講義】強調構文について(2)",
      "【補完講義】強調構文について(3)",
      "【補完講義】強調構文について(4)",
      "【補完講義】強調構文について(5)",
      "【補完講義】強意[強調]の副詞 badly",
      "【補完講義】疑問詞を強調する副詞",
      "【補完講義】強意[強調]の形容詞 single",
      "【補完講義】強意[強調]の形容詞 imaginable, possible(1)",
      "【補完講義】強意[強調]の形容詞 imaginable, possible(2)",
      "【補完講義】強調語としての助動詞 do",
      "【補完講義】「他動詞+代名詞+副詞」の語順ルール(1)",
      "【補完講義】「他動詞+代名詞+副詞」の語順ルール(2)"
    ]
  },
  "LESSON17": {
    "必須イディオム": [
      "face について",
      "spot について",
      "steal と rob の語法について",
      "add について(1)",
      "add について(2)",
      "contribute について(1)",
      "contribute について(2)",
      "get through A と go through A (1)",
      "get through A と go through A (2)",
      "charge について",
      "term について(1)",
      "term について(2)",
      "term について(3)",
      "term について(4)",
      "favorite について",
      "コラム⑰"
    ],
    "省略・挿入・代用表現": [
      "疑問代名詞の what を用いた慣用表現(1)",
      "疑問代名詞の what を用いた慣用表現(2)",
      "付加疑問文について(1)",
      "付加疑問文について(2)",
      "主節の移動・挿入について",
      "that節の代用としての so や not (1)",
      "that節の代用としての so や not (2)",
      "副詞節中の「主語+be動詞」の省略について(1)",
      "副詞節中の「主語+be動詞」の省略について(2)",
      "慣用的な省略表現(1)",
      "慣用的な省略表現(2)",
      "繰り返しを避けるために生じる省略について",
      "【補完講義】疑問詞関連の省略(1)",
      "【補完講義】疑問詞関連の省略(2)",
      "【補完講義】疑問詞関連の省略(3)",
      "【補完講義】同格の基本と同格の that"
    ]
  },
  "LESSON18": {
    "必須イディオム": [
      "tie について",
      "insist について",
      "stick",
      "inform について",
      "be able to 型の助動詞表現(1)",
      "be able to 型の助動詞表現(2)",
      "「～について[関して]」のいろいろ(1)",
      "「～について[関して]」のいろいろ(2)",
      "「～について[関して]」のいろいろ(3)",
      "コラム⑱(1)",
      "コラム⑱(2)",
      "コラム⑱(3)",
      "inquire について"
    ],
    "前置詞": [
      "前置詞の基本と頻出ポイント(1)",
      "前置詞の基本と頻出ポイント(2)",
      "前置詞の基本と頻出ポイント(3)",
      "前置詞の基本と頻出ポイント(4)",
      "前置詞の基本と頻出ポイント(5)",
      "前置詞の基本と頻出ポイント(6)",
      "前置詞の基本と頻出ポイント(7)",
      "前置詞の基本と頻出ポイント(8)",
      "前置詞の基本と頻出ポイント(9)",
      "前置詞の基本と頻出ポイント(10)",
      "前置詞の基本と頻出ポイント(11)",
      "前置詞の基本と頻出ポイント(12)",
      "前置詞の基本と頻出ポイント(13)",
      "by と until[till]",
      "「of+抽象名詞」は形容詞化する",
      "「with+抽象名詞」は副詞化する",
      "【補完講義】with のまとめ(1)",
      "【補完講義】with のまとめ(2)",
      "【補完講義】with O C の復習"
    ]
  }
}
}
