const hsMathCourses = {
  "香川亮の一冊逆転 数学Ⅰ・A Basic": {
    "第1章 式と計算": {
      "第1節 文字式の計算": [
        "1-1 様々な用語",
        "1-2 整式の加法・減法",
        "1-3 単項式の乗法",
        "1-4 多項式の乗法"
      ],
      "第2節 展開": [
        "2-1 (x+a)(x+b)の展開",
        "2-2 2乗の展開公式",
        "2-3 和と差の積の展開公式",
        "2-4 3項の2乗の展開公式"
      ],
      "第3節 因数分解": [
        "3-1 共通因数でくくる",
        "3-2 和の平方と差の平方の因数分解",
        "3-3 平方の差の因数分解",
        "3-4 x^2+(a+b)x+ab型の因数分解",
        "3-5 たすき掛けの因数分解"
      ],
      "第4節 実数": [
        "4-1 循環小数",
        "4-2 平方根の意味",
        "4-3 根号を含む式の計算",
        "4-4 分母の有理化",
        "4-5 2重根号",
        "4-6 整数部分・小数部分",
        "4-7 無理数の相当",
        "4-8 絶対値",
        "4-9 絶対値と1次方程式",
        "4-10 平方根と絶対値",
        "4-11 絶対値を含む式のグラフ",
        "4-12 2文字の対称式",
        "4-13 逆数と対称式"
      ],
      "第5節 1次方程式と不等式": [
        "5-1 1次方程式",
        "5-2 連立1次方程式",
        "5-3 3文字の連立1次方程式",
        "5-4 1次不等式",
        "5-5 連立1次不等式",
        "5-6 絶対値と不等式"
      ]
    },

    "第2章 集合と命題": {
      "第1節 集合": [
        "1-1 集合の表し方",
        "1-2 ド・モルガンの法則",
        "1-3 和集合の要素の個数"
      ],
      "第2節 命題": [
        "2-1 真偽",
        "2-2 条件の否定",
        "2-3 必要条件・十分条件"
      ],
      "第3節 命題と証明": []
    },

    "第3章 2次関数": {
      "第1節 2次関数とグラフ": [
        "1-1 関数",
        "1-2 2次関数と平行移動",
        "1-3 2次関数の頂点",
        "1-4 平方完成",
        "1-5 グラフの対称移動",
        "1-6 2次関数のグラフ"
      ],
      "第2節 2次関数の最大・最小と決定": [
        "2-1 最大・最小",
        "2-2 定義域に制限があるときの最大・最小",
        "2-3 軸が動く場合の最大・最小（下に凸の放物線の最小値）",
        "2-4 軸が動く場合の最大・最小（下に凸の放物線の最大値）",
        "2-5 軸が動く場合の最大・最小（上に凸の放物線）",
        "2-6 2次関数の決定（頂点や軸に関する条件が与えられた場合）",
        "2-7 2次関数の決定（最大値・最小値が与えられた場合）",
        "2-8 2次関数の決定（グラフ上の3点が与えられた場合）"
      ],
      "第3節 2次方程式": [
        "3-1 2次方程式の基本",
        "3-2 2次方程式の実数解の個数",
        "3-3 連立2次方程式",
        "3-4 共通解問題",
        "3-5 2次関数のグラフとx軸の共有点の座標",
        "3-6 2次関数のグラフとx軸の共有点の個数",
        "3-7 2次関数のグラフがx軸から切り取る線分の長さ",
        "3-8 放物線と直線の共有点の座標",
        "3-9 放物線と直線の共有点の個数",
        "3-10 2次関数の係数の符号"
      ],
      "第4節 2次不等式": [
        "4-1 2次不等式の基本",
        "4-2 連立2次不等式",
        "4-3 2次不等式の解の配置問題（存在範囲）①",
        "4-4 2次不等式の解の配置問題（存在範囲）②"
      ]
    }
  }
};